Design-template/app/Controllers/Emprunt.php

    public function pret(int $livreId)
    {
        $livreModel = new LivreModel();
        $empruntModel = new EmpruntModel();

        $livre = $livreModel->find($livreId);
        if ($livre === null) {
            return redirect()->to('/livre')->with('error', 'Livre introuvable.');
        }

        if (($livre['statut'] ?? '') !== 'disponible') {
            return redirect()->to('/livre')->with('error', 'Ce livre est deja prete.');
        }

        $nomEmprunteur = trim((string) $this->request->getPost('nom_emprunteur'));
        if ($nomEmprunteur === '') {
            return redirect()->to('/livre')->with('error', "Le nom de l'emprunteur est obligatoire.");
        }

        $db = \Config\Database::connect();
        $db->transStart();

        $empruntModel->insert([
            'livre_id' => $livreId,
            'nom_emprunteur' => $nomEmprunteur,
            'date_emprunt' => date('Y-m-d'),
            'date_retour' => null,
        ]);

        $livreModel->update($livreId, ['statut' => 'prete']);
---
INSERT INTO `emprunts` (`livre_id`, `nom_emprunteur`, `date_emprunt`, `date_retour`) VALUES (1, 'Mariah', '2026-04-21', NULL)
UPDATE `livres` SET `statut` = 'prete', `updated_at` = '2026-04-21 13:08:43'
WHERE `livres`.`identifiant` IN (1)

    public function retour(int $livreId)
    {
        $livreModel = new LivreModel();
        $empruntModel = new EmpruntModel();

        $livre = $livreModel->find($livreId);
        if ($livre === null) {
            return redirect()->to('/livre')->with('error', 'Livre introuvable.');
        }

        $empruntActif = $empruntModel->empruntActif($livreId);
        if ($empruntActif === null) {
            return redirect()->to('/livre')->with('error', 'Aucun emprunt actif trouve pour ce livre.');
        }

        $db = \Config\Database::connect();
        $db->transStart();

        $empruntModel->update($empruntActif['identifiant'], [
            'date_retour' => date('Y-m-d'),
        ]);

        $livreModel->update($livreId, ['statut' => 'disponible']);
---
UPDATE `livres` SET `statut` = 'disponible', `updated_at` = '2026-04-21 14:38:19'
WHERE `livres`.`identifiant` IN (1)