Design-template/app/Controllers/Livre.php

    public function index(): string
    {
        $livreModel = new LivreModel();

        $motCle = trim((string) $this->request->getGet('q'));
        $categorie = trim((string) $this->request->getGet('categorie'));

        if ($motCle !== '' || $categorie !== '') {
            $livres = $livreModel->rechercher($motCle, $categorie)->paginate(self::PER_PAGE, 'livres');
---
SELECT COUNT(*) AS `numrows`
FROM `livres`
WHERE `categorie` = 'Roman'

            'statut' => 'disponible',
        ];

        if (! $livreModel->insert($data)) {
---
INSERT INTO `livres` (`titre`, `auteur`, `ISBN`, `annee_publication`, `categorie`, `resume`, `nom_fichier_couverture`, `statut`, `created_at`, `updated_at`) VALUES ('Le faiseur de rêve ', 'Laini Taylor', '152-MSF/8', 2014, 'Histoire', 'histgugmo', '1776777256_8c8ec89c8003f9c22318.webp', 'disponible', '2026-04-21 13:14:16', '2026-04-21 13:14:16')