Design-template/app/Models/EmpruntModel.php

SELECT *
FROM `emprunts`
WHERE `livre_id` = 1
ORDER BY `date_emprunt` DESC, `identifiant` DESC
 LIMIT 1
---
    public function dernierEmprunt(int $livreId): ?array
    {
        return $this->where('livre_id', $livreId)
            ->orderBy('date_emprunt', 'DESC')
            ->orderBy('identifiant', 'DESC')
            ->first();

SELECT *
FROM `emprunts`
WHERE `livre_id` = 1
AND `date_retour` IS NULL
ORDER BY `date_emprunt` DESC, `identifiant` DESC
 LIMIT 1
---
    public function empruntActif(int $livreId): ?array
    {
        return $this->where('livre_id', $livreId)
            ->where('date_retour', null)
            ->orderBy('date_emprunt', 'DESC')
            ->orderBy('identifiant', 'DESC')
            ->first();