Design-template/app/Models/LivreModel.php

    public function getLivresPagines(int $perPage = 10, string $group = 'livres'): array
    {
        return $this->orderBy('created_at', 'DESC')->paginate($perPage, $group);
---
SELECT *
FROM `livres`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `livres`

    public function getCategories(): array
    {
        return $this->select('categorie')
            ->distinct()
            ->where('categorie IS NOT NULL', null, false)
            ->where('categorie !=', '')
            ->orderBy('categorie', 'ASC')
            ->findColumn('categorie') ?? [];
---
SELECT DISTINCT `categorie`, `categorie`
FROM `livres`
WHERE categorie IS NOT NULL
AND `categorie` != ''
ORDER BY `categorie` ASC